var a_idx = 0;
jQuery(document).ready(function ($) {
    var b = new Array("😀", "😂", "❤", "😍", "😒", "😘", "💕", "😁", "🤞", "💖", "😜", "💋", "🌹", "😊", "😆", "✨", "🤩", "😚", "😭", "😇", "🤭", "😻", "🙈", "🐾")
    $("body").click(function (e) {
        var c = Math.round(Math.random() * 23);
        var a = new Array("嘿嘿", "嘻嘻", "坏猫猫", "好猫猫", "乖猫猫", "怪猫猫", "哼哼", "忘记分开后的第几天起", "喜欢一个人 看下大雨", "没联络 孤单就像连锁反应", "想要快乐都没力气", "雷雨世界像场灾难电影", "让现在的我 可怜到底", "对不起 谁也没有时光机器", "已经结束的没有商量的余地", "我希望你 是我独家的记忆", "摆在心底", "不管别人说的多么难听", "现在我拥有的事情", "是你 是给我一半的爱情", "我喜欢你 是我独家的记忆", "谁也不行", "从我这个身体中拿走你", "在我感情的封锁区", "有关于你 绝口不提 没问题", "雷雨世界像场灾难电影", "让现在的我 可怜到底", "对不起 谁也没有时光机器", "已经结束的 没有商量的余地", "我希望你 是我独家的记忆", "摆在心底", "不管别人说的多么难听", "现在我拥有的事情", "是你 是给我一半的爱情", "我喜欢你 是我独家的记忆", "谁也不行", "从我这个身体中拿走你", "在我感情的封锁区", "有关于你绝口不提 没关系", "我喜欢你 是我独家的记忆", "摆在心底", "不管别人说的多么难听", "现在我拥有的事情", "是你 是给我一半的爱情", "我喜欢你 是我独家的记忆", "谁也不行", "从我这个身体中拿走你", "在我感情的封锁区", "有关于你 绝口不提 没限期", "这个世界有多甜", "眷顾平凡的少年", "借你的笑眼 地球转一圈", "好吧一辈子晕眩", "别偷听我的心愿", "我想它已经灵验", "等无边的黑夜 输给地平线", "见证孤单的终点", "我们还有好多好多年", "将未完的预言都实现", "锁在日记手写的思念", "你发足狂奔 赶来拥抱我的长街", "我不管他们说多少至理名言", "我除了你没有第二志愿", "就用这青春的手验算永远的远", "我明白总有些遗憾无法幸免", "只求这场告白不算荒年", "感谢 你说你很乐意去揭开一切悬念", "滴答滴答 我们的遇见", "滴答滴答 我们就永远", "我们还有好多好多年", "也许每一步都是瓦解", "如果时间问你怎么选", "麻烦你的心 可以偏向我的这边", "我不管他们说多少至理名言", "我除了你没有第二志愿", "就用这青春的手验算永远的远", "我明白总有些遗憾无法幸免", "只求这场告白不算荒年", "感谢 你说你很乐意去揭开一切悬念", "我不管他们说什么天高路远", "我除了你没有第二志愿", "就让鸽子去蓝天 悲伤送给诗篇", "我明白总有些遗憾只能亏欠", "但求这本旅途终章喜悦", "感谢 你说你很乐意去陪我抵达明天", "滴答滴答 你视而不见", "滴答滴答 你百看不厌");
        var $i = $("<span/>").text(b[c] + a[a_idx] + b[c]);
        a_idx = (a_idx + 1) % a.length;
        var x = e.pageX,    
            y = e.pageY;
        var getRandomColor = function() {
            return "rgb(" + Math.round(Math.random() * 255) + "," + Math.round(Math.random() * 255) + ',' + Math.round(Math.random() * 10) + ')';
        }
        $i.css({
            "z-index": 9999999999999999999999999999999999999999999999999999,
            "top": y - 20,
            "left": x,
            "position": "absolute",
            "font-weight": "bold",
            "color": getRandomColor(),
            FontFace: "/font/SIMSUN.TTC"
        });
        // $i.css.color = "red";
        $("body").append($i);
        $i.animate({
            "top": y - 180,
            "opacity": 0
        },
            1800,
            function () {
                $i.remove();
            });
    });
});